In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
df = pd.read_csv(r'C:\Users\ASUS\m\CS_Group_09_Salary_prediction\data\Salary_Data.csv')
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [10]:
df.shape

(6704, 6)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [12]:
df.describe()

               Age  Years of Experience         Salary
count  6702.000000          6701.000000    6699.000000
mean     33.620859             8.094687  115326.964771
std       7.614633             6.059003   52786.183911
min      21.000000             0.000000     350.000000
25%      28.000000             3.000000   70000.000000
50%      32.000000             7.000000  115000.000000
75%      38.000000            12.000000  160000.000000
max      62.000000            34.000000  250000.000000

In [13]:
x=df.iloc[:,1:5]
x.head()

   Gender Education Level          Job Title  Years of Experience
0    Male      Bachelor's  Software Engineer                  5.0
1  Female        Master's       Data Analyst                  3.0
2    Male             PhD     Senior Manager                 15.0
3  Female      Bachelor's    Sales Associate                  7.0
4    Male        Master's           Director                 20.0

In [14]:
y=df.iloc[:,-1]
y.head()

0     90000.0
1     65000.0
2    150000.0
3     60000.0
4    200000.0
Name: Salary, dtype: float64

In [15]:
from sklearn.preprocessing import StandardScaler
scaler =StandardScaler()

In [20]:
x = df[['Salary']]  
x = scaler.fit_transform(x)
x[0:5]

array([[-0.47983873],
       [-0.95348286],
       [ 0.65690718],
       [-1.04821168],
       [ 1.60419544]])